/* Запросіть у користувача ціле число і виведіть у відповідь
чи це число парне або непарне. В завданні використовуйте логічні оператори і не використовуйте if та switch. */
"use strict"

let number = +prompt('Бажаєте перевірити ваше число на парність?\nТоді попрошу, введіть ваше ціле число:');

let res = number % 2 
    ? `Ваше число (${number}) є не парним` 
    : `Ваше число (${number}) є парним`
alert(res);

/*
let n = 3;
let res = n % 2;
if (res == 0){
    console.log('це число парне');
} else {
    console.log('цe число не парне');
}
*/



