/* Запросіть у користувача відстань у кілометрах між двома
містами та за скільки годин він хоче дістатися. Порахуйте
швидкість, з якою потрібно рухатися, щоб встигнути вчас-
но.
*/
"using strict"

// s - відстань, v - швидкість, t - час;

let s = +prompt(`Вирушаєте в дорогу та потрібно порахувати відстань?\nТоді Введіть відстань у кілометрах між місцем призначенням та місце звідки вирушаєте:`);
let t = +prompt('Та за скільки годин ви хочете туди дістатися');

let v = s / t;
alert(`Швидкість з якою потрібно рухатися, щоб встигнути вчасно складає:\n${v} кілометрів на годину`);

alert(`Перевіремо, знайдемо відстань помноживши час на швидкість: \n${v * t} (км)\nВсе чітко, гарної дороги!`);
