/*? Запросіть у користувача його вік та визначіть, ким він є:
дитиною (0–12), підлітком (12–18), дорослим (18–60) або
пенсіонером (60– …). */

// let style = "color: #009473; padding: 20px; font-weight: 700; background: #fff";
// console.log("%c Перевірка віку", style);

let age = +prompt('Введіть свій вік');

if(age <= 3 && age > 0) {
    alert('Привіт, малеча');
} else if (age > 3 && age < 18) {
    alert('Привіт, тобі менше 18');
} else if (age >= 18 && age < 65) {
    alert('Привіт, повнолітній');
} else if (age >= 65 && age <= 123) {
    alert('Привіт! Моє шанування!');
} else {
    alert('У вас дуже не звичний вік :) ');
}