/*? Запросіть у користувача рік та перевірте чи є він високо-
сним. Високосний рік або кратний 400, або кратний 4 і при
цьому не кратний 100. */

//! Leap Year	Not Leap Year
//!    1968	        1971
//!    2004	        2006
//!    2012	        2010
//!    1200	        1700
//!    1600	        1800
//!    2000	        1900

let year = +prompt ('Введіть рік, перевіремо чи є він високосним');

if (year > 0) {
    if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0) {
        alert('Цей рік, Високосний');
    } else {
        alert('Цей рік, Не високосний');
    }
} else {
    alert('Ви що з майбутнього? Наразі вводять рік цифрою');
}