/*? Запросіть у користувача довжину кола та периметр квадрата. Визначте чи може таке коло поміститися у зазначений квадрат. */ 
"using strict";
const output = document.getElementById('output');
// p - периметр квадрату, c - довжина круга, sp - площа квадрату, sc - площа круга

let p = +prompt('Введіть периметр квадрата');
let c = +prompt('Введіть довжину круга');

let sp = (p ** 2) / 16;
let sc = c * 2;

let res;
res = sp > sc ? res = (`Такий круг може поміститись у такий квадрат`) : res = (`Такий круг НЕ може поміститись у такий квадрат`);

output.innerText = (res);

