//? Задайте користувачеві 3 питання, у кожному питанні по 3 варіанти відповіді. За кожну правильну відповідь нарахо-вується 2 бали. Після запитань виведіть користувачеві кількість набраних балів.
'using strict'

const output = document.getElementById('output');

let points = 0;
alert('Ну що зіграємо у загадки? За кожну правильну відповідь отриєте по 2 бали, перевіримо на що ви здатні'); 
let q1 = prompt('Введіть букву з поданих варіантів відповідей (in en.(а, b, c))\nІ так Перша загадка:\n"Річка з`їхала з глузду — По будинках пішла сама"\n\nВаріанти відповідей:\na) Водопровід\nb) Повінь\nc) сьози Либеді\n\nЩо думаєш?');

switch (q1) {
    case 'a' || 'а':
        alert('Правильно, осьо тримай 2 бали');
        points = points + 2;
        console.log('points: ', points);
    break;
    case 'b' || 'б':
        alert('Неправильно :(');
    break;
    case 'c' || 'с':
        alert('Неправильно :(');
    break;
    default:
        alert('Незнаєш? А якщо подумати?');
}

let q2 = prompt('Друга загадка:\n"Хто говорить на всіх мовах?"\n\nВаріанти відповідей:\na) Білінгв\nb) Онлайн Перекладач\nc) Ехо');
switch (q2) {
    case 'a' || 'а':
        alert('Неправильно :(');
    break;
    case 'b' || 'б':
        alert('Неправильно :(');
    break;
    case 'c' || 'с':
        alert('Правильно, осьо тримай 2 бали');
        points = points + 2;
    break;
    default:
        alert('Незнаєш? А якщо подумати?');
}

const q3 = prompt('Третя загадка:\nЩо не можна з`їсти, але можна приготувати?\n\nВаріанти відповідей:\na) Домашнє завдання\nb) Бетон\nc) Ліжко\n\nA тут що?');
switch (q3) {
    case 'a' || 'а':
        alert('Правильно, осьо тримай 2 бали');
        points = points + 2;
    break;
    case 'b' || 'б':
        alert('Правильно, осьо тримай 2 бали');
        points = points + 2;
    break;
    case 'c' || 'с':
        alert('Правильно, осьо тримай 2 бали');
        points = points + 2;
    break;
    default:
        alert('Незнаєш? А якщо подумати?');
}
alert(`Вітаю, ви пройшли квест! Ви назбирали, ${points} балів, Дякую за увагу, GG`);
