//? Гра «Вгадай число». Запропонуйте користувачеві загадати число від 0 до 100 і відгадати його наступним способом: в кожній ітерації циклу поділяєте діапазон чисел навпіл,записуєте результат в N і запитуєте у користувача «Ваше число > N, < N або == N?». Залежно від відповіді користувача, зменшуєте діапазон. Початковий діапазон від 0 до 100, поділяєте навпіл і отримуєте 50. Якщо користувач вказав, що його число > 50, змінюєте діапазон числа від 51 до 100. І так доти, доки користувач не вибере == N.

// let choose;
let N = 0;
// let numb = +prompt('Загадайте число від 0 до 100');
let numb = 24; 

    let choose = prompt('Ваше число > 50, < 50 або == 50? (Введіть один із знаків ">", "<", "==")');
    if (choose == '<') {
        console.log('Менше 50');

        choose = prompt('Ваше число > 25, < 25 або == 25? (Введіть один із знаків ">", "<", "==")');

        if (choose == '<') {
            console.log('Менше 25');
        } else {
        console.log('Більше 25');
        }
    } else {
        console.log('Більше 50');
    }

prompt('Ваше число > 50, < 50 або == 50? (Введіть один із знаків ">", "<", "==")');